TexasInstruments/open-pru/examples/mirror_input/mcuplus/am263px-lp/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --part "AM263P4" --package "ZCZ_C" --context "r5fss0-0" --product "OPEN_PRU@2026.02.00" --product "MCU_PLUS_SDK_AM263Px@11.00.00"
 * @v2CliArgs --device "AM263P4-Q1" --package "NFBGA (ZCZ-C)" --context "r5fss0-0" --product "OPEN_PRU@2026.02.00" --product "MCU_PLUS_SDK_AM263Px@11.00.00"
 * @versions {"tool":"1.26.0+4407"}
 */

/**
 * Import the modules used in this configuration.
 */
const ethphy          = scripting.addModule("/board/ethphy/ethphy", {}, false);
const ethphy1         = ethphy.addInstance();
const ioexp           = scripting.addModule("/board/ioexp/ioexp", {}, false);
const ioexp1          = ioexp.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const pruicss         = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1        = pruicss.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const section13       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ethphy1.$name    = "CONFIG_ETHPHY0";
ethphy1.mdioPort = 1;

ioexp1.$name                                            = "CONFIG_IOEXP0";
ioexp1.i2cAddress                                       = "LP-E2 0x20";
ioexp1.TCA6416ARTWR_port0_pinAM263P_PRU_MUX_SEL_mode    = 0;
ioexp1.TCA6416ARTWR_port0_pinAM263P_PRU_MUX_SEL_state   = 1;
ioexp1.TCA6416ARTWR_port1_pinAM263P_PRU_BP_MUX_EN_mode  = 0;
ioexp1.TCA6416ARTWR_port0_pinAM263P_BP_MUX_SEL_mode     = 0;
ioexp1.TCA6416ARTWR_port0_pinAM263P_BP_MUX_SEL_state    = 1;
ioexp1.TCA6416ARTWR_port1_pinAM263P_PRU_BP_MUX_EN_state = 1;

gpio1.$name          = "WAKE_PIN";
gpio1.pinDir         = "OUTPUT";
gpio1.pu_pd          = "pd";
gpio1.GPIO_n.$assign = "PR0_PRU0_GPIO15";

gpio2.pinDir         = "OUTPUT";
gpio2.$name          = "PLCA_DEBUG_GPO";
gpio2.GPIO_n.$assign = "EPWM8_B";

i2c1.$name              = "CONFIG_I2C0";
ioexp1.peripheralDriver = i2c1;
i2c1.I2C.$assign        = "I2C1";
i2c1.I2C.SCL.$assign    = "I2C1_SCL";
i2c1.I2C.SDA.$assign    = "I2C1_SDA";
i2c1.I2C_child.$name    = "drivers_i2c_v1_i2c_v1_template0";

pruicss1.$name                                                                                     = "CONFIG_PRU_ICSS0";
pruicss1.iepSyncMode                                                                               = true;
pruicss1.AdditionalICSSSettings[0].$name                                                           = "CONFIG_PRU_ICSS_IO0";
pruicss1.AdditionalICSSSettings[0].PruGPIO.create(1);
pruicss1.AdditionalICSSSettings[0].PruGPIO[0].$name                                                = "CONFIG_PRU_ICSS_GPIO0";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].$assign                                  = "PRU-ICSS";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO9.pu_pd                     = "pu";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO9.rx                        = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO10.pu_pd                    = "pu";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO10.rx                       = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO4.pu_pd                     = "pu";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO0.rx                        = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO0.$used                     = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO1.pu_pd                     = "pu";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO1.$assign                   = "PR0_PRU0_GPIO1";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO1.$used                     = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO11.pu_pd                    = "pu";
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU0_GPIO11.rx                       = true;
pruicss1.AdditionalICSSSettings[0].PruGPIO[0]["PRU-ICSS"].PR0_PRU1_GPIO17.rx                       = true;
pruicss1.AdditionalICSSSettings[0].PruIepIO.create(1);
pruicss1.AdditionalICSSSettings[0].PruIepIO[0].$name                                               = "CONFIG_PRU_ICSS_IEP0";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0]["PRU-ICSS_IEP"].PR0_IEP0_EDIO_DATA_IN_OUT31.$assign = "PR0_PRU1_GPIO18";
pruicss1.AdditionalICSSSettings[0].PruIepIO[0]["PRU-ICSS_IEP"].PR0_IEP0_EDIO_DATA_IN_OUT31.$used   = true;

debug_log.enableUartLog            = true;
debug_log.enableSharedMemLog       = true;
debug_log.enableSharedMemLogReader = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

